#pragma once
#include "XThreadBase.h"

class VideoCaptureThread : public XThreadBase
{
public:
	VideoCaptureThread(XThreadMgr* mgr_);
	virtual ~VideoCaptureThread();

	/************************************************************************
	* 名称：OnTimer
	* 说明：//定时器实现者实现该函数。
	* 参数：id定时器事件ID
	* 返回值：无
	/************************************************************************/
	virtual void OnTimer(int id) ;

	/************************************************************************
	* 名称：OnAttach
	* 说明：附加对象到线程成功事件
	* 参数：无
	* 返回值：无
	/************************************************************************/
	virtual void OnAttach();

	/************************************************************************
	* 名称：OnDetach
	* 说明：从线程分离事件
	* 参数：无
	* 返回值：无
	/************************************************************************/
	virtual void OnDetach();

	/************************************************************************
	* 名称：OnMsg
	* 说明：响应其他线程的消息
	* 参数：cmd 命令ID,lparm,wparam
	* 返回值：无
	/************************************************************************/
	virtual void OnMsg(int cmd_, long long  lparm_, long long wparam_);

private:

};

